[
  {
    "partner_dialog": "Steph",
    "start_dialog": "Hi, Jasmine! How are you?",
    "dialog": [
      {
        "id": 1,
        "user_options": [
          {
            "id": "1a",
            "reply": "Hi, Steph! I'm great! How about you?",
            "response": "I’m doing well! Thanks for asking. By the way, I’m throwing a birthday party this weekend at Hotel Merlian. Would you like to come?"
          },
          {
            "id": "1b",
            "reply": "I’m doing wonderful! Thanks for asking.",
            "response": "I’m doing well! Thanks for asking. By the way, I’m throwing a birthday party this weekend at Hotel Merlian. Would you like to come?"
          },
          {
            "id": "1c",
            "reply": "I’m great, thanks!",
            "response": "I’m doing well! Thanks for asking. By the way, I’m throwing a birthday party this weekend at Hotel Merlian. Would you like to come?"
          }
        ]
      },
      {
        "id": 2,
        "user_options": [
          {
            "id": "2a",
            "reply": "That’s awesome! I’d love to be there. Any special dress code?",
            "response": "Just dress chic but, you know, don't go too overboard with the outfit. It's my night after all! 😉"
          },
          {
            "id": "2b",
            "reply": "That sounds fantastic! I'd love to join. What time should I be there?",
            "response": "The party starts at 7 PM, but it would be awesome if you could come a bit earlier. Oh, and the dress code is chic, but nothing too flashy—let's keep it elegant since it's my special night! 😉"
          },
          {
            "id": "2c",
            "reply": "Of course, I’d love to join. What time does the party start?",
            "response": "The party starts at 7 PM, but it would be awesome if you could come a bit earlier. Oh, and the dress code is chic, but nothing too flashy—let's keep it elegant since it's my special night! 😉"
          }
        ]
      },
      {
        "id": 3,
        "user_options": [
          {
            "id": "3a",
            "reply": "Sure, I'll keep it classy. By the way, I noticed your latest post... Are you and James dating now?",
            "response": "Yeah, we’ve been dating for a little while now. I was going to tell you in person. Are you okay with it?"
          },
          {
            "id": "3b",
            "reply": "Of course, I'll keep it stylish but understated. Hey, I noticed something in your last post... Are you and James seeing each other now?",
            "response": "Oh, I was going to tell you about that. Yes, James and I are seeing each other. I hope it’s not too awkward for you."
          },
          {
            "id": "3c",
            "reply": "No worries, I'll keep it chic. Just curious, I noticed your recent post... Are you and James a thing?",
            "response": "Yes, we’re together now. I really hope this doesn't make things awkward between us."
          }
        ]
      }, 
      {
        "id": 4,
        "user_options": [
          {
            "id": "4a",
            "reply": "I can't believe this, Steph! You knew James and I had just broken up, and now you're dating him?",
            "response": "I'm truly sorry, Jasmine. This wasn't how I wanted you to find out. It just happened, and I didn't know how to tell you."
          },
          {
            "id": "4b",
            "reply": "Seriously, Steph? You knew how much James meant to me, and now you're with him? This feels like such a betrayal.",
            "response": "Jasmine, I'm really sorry. I never wanted to hurt you. It just happened, and I was scared to tell you."
          },
          {
            "id": "4c",
            "reply": "Wow, Steph, I didn't expect this from you. James and I just ended things, and now you're together?",
            "response": " I understand if you're upset, Jasmine. It wasn't planned, and I didn't know how to bring it up."
          }
        ]
      },
      {
        "id": 5,
        "user_options": [
          {
            "id": "5a",
            "reply": "You didn't know how to tell me? You should have thought about how it would make me feel! This is so messed up.",
            "response": "I get that you're upset, and you have every right to be. Can we please talk about this in person? I don’t want things to be this way between us."
          },
          {
            "id": "5b",
            "reply": "That’s weak, Steph. You should have thought about my feelings. This is really hurtful.",
            "response": "I know, and I'm really sorry. I never wanted to hurt you. Can we please talk about this more and try to work things out?"
          },
          {
            "id": "5c",
            "reply": "Seriously, Steph? You didn’t know how to tell me? You should have been honest from the start. This is so unfair.",
            "response": "You're right, I should have been honest with you. I regret not telling you sooner. Can we please talk about this and try to find a way to move forward?"
          }
        ]
      },
      {
        "id": 6,
        "user_options": [
          {
            "id": "6a",
            "reply": "I don't know, Steph. I'm really hurt right now. I'll need some time to process this.",
            "response": "Take all the time you need. I just hope we can work through this eventually. You're still my friend, and I care about you."
          },
          {
            "id": "6b",
            "reply": "I'm not sure, Steph. This is a lot to take in. I need some time to process everything.",
            "response": "I understand. Take all the time you need. Just know that I truly value our friendship, and I hope we can get through this."
          },
          {
            "id": "6c",
            "reply": "I'm not sure, Steph. This is a lot to take in. I need some time to process everything.",
            "response": "I understand how you feel. Please know that I'm here whenever you're ready to talk. I truly value our friendship and hope we can work through this."
          }
        ]
      }
    ]
  },
  {
    "partner_dialog": "James",
    "start_dialog": " (chat paling pertama bgt ex. Hi jasmine, Hi james, dll. ) ",
    "dialog": [
      {
        "id": 1,
        "user_options": [
          {
            "id": "1a",
            "reply": "(reply option user 1)",
            "response": "(response partner dari reply 1)"
          },
          {
            "id": "1b",
            "reply": "(reply option user 2)",
            "response": "(response partner dari reply 2)"
          },
          {
            "id": "1c",
            "reply": " ",
            "response": " "
          }
        ]
      },
      {
        "id": 2,
        "user_options": [
          {
            "id": "2a",
            "reply": " (abis dapet response drj no.1, user dpt option apa lagi)",
            "response": "(response partner dari reply ini)"
          },
          {
            "id": "2b",
            "reply": " ",
            "response": " "
          },
          {
            "id": "2c",
            "reply": " ",
            "response": " "
          }
        ]
      }
    ]
  }
]
